AccumulationRegisters/ТМЦПереданныеСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ТМЦПереданныеСотрудникам</Name>
			<Comment>Товарно-материальные ценности, переданные сотрудникам</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Comment>Дилерский Центр</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартияТМЦ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеТМЦ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТМЦ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТМЦ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТМЦПереданныеСотрудникам/Ext/RecordSetModule.bsl
Перем РежимПроведения Экспорт; // Режим проведения документа. Если проведение неоперативное - проверок остатков нет

Перем ДокументОбъект Экспорт; //Документ, осуществляющий движение по регистру
Перем РезультатЗапросаПоТоварам Экспорт; //Выборка табличной части или таблица значений табличной части товаров
Перем ПериодДвижения Экспорт; //Период движения регистра. Если период не задан, он берется из ДокументОбъект.Дата
Перем ШапкаДокумента Экспорт; // Выборка или строка таблицы значений, в которой содержаться необходимые данные о шапке документа

////////////////////////////////////////////////////////////////////////
//Функции модуля набора записей

// Возвращает результат запроса по таблице товаров
Функция ПолучитьТаблицуТоваров()
	// получим результат запроса по товарной таблице
    ВидДок=ДокументОбъект.Метаданные().Имя;
 	Запрос=Новый Запрос();
	ТекстЗапроса="
	|ВЫБРАТЬ
	|	ДокументТовары.Номенклатура КАК Номенклатура,
 	|	ДокументТовары.Количество*ДокументТовары.Коэффициент КАК Количество,
 	|	ДокументТовары.Партия КАК Партия,
	|	ДокументТовары.СуммаВсего КАК Сумма
  	|ИЗ
	|	Документ."+ВидДок+".Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка=&Ссылка
	|";
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка",ШапкаДокумента.Ссылка);
	
	Возврат Запрос.Выполнить();
КонецФункции

// Формирует движения по регистру приход (увеличение товара в производстве)
// Возвращаемое значение: Булево. Истина - все ОК, Ложь - ошибка.
Функция Приход() Экспорт
	ВсеОК=Истина;
	
 	
	ПериодДвижения=?(ПериодДвижения=Неопределено,ШапкаДокумента.Дата,ПериодДвижения);
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	//Если ШапкаДокумента.КурсВалютыУпр=0 Тогда
	//	СтруктураКурса=обКурсДляВалюты(ВалютаУпр,ПериодДвижения);
	//	КурсУпр=СтруктураКурса.Курс/?(СтруктураКурса.Кратность=0,1,СтруктураКурса.Кратность);
	//Иначе
	//	КурсУпр=ШапкаДокумента.КурсВалютыУпр;
	//КонецЕсли; 
	
	// получим таблицу товарного состава
	Если (РезультатЗапросаПоТоварам=Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоТоварам)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоТоварам)<>Тип("ТаблицаЗначений")) Тогда
		РезультатЗапросаПоТоварам=ПолучитьТаблицуТоваров();
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоТоварам)=Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам.Выгрузить();
	КонецЕсли;
	ВремРезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам.Скопировать();
	ЕстьГТД=РезультатЗапросаПоТоварам.Колонки.Найти("ГТД")<>Неопределено;
  	КолонкиСуммирования="Количество,Сумма";
	Если ВремРезультатЗапросаПоТоварам.Колонки.Найти("СуммаУпр")<>Неопределено Тогда
		КолонкиСуммирования=КолонкиСуммирования+",СуммаУпр";
	КонецЕсли; 
	
	ВремРезультатЗапросаПоТоварам.Свернуть("Номенклатура","Количество,Сумма");

	Если ДокументОбъект.Метаданные().Движения.Содержит(Метаданные.РегистрыНакопления.ГТДПартийТоваровКомпании) Тогда
		НаборЗаписейГТД=ДокументОбъект.Движения.ГТДПартийТоваровКомпании.Выгрузить();
	Иначе
		НаборЗаписейГТД=РезультатЗапросаПоТоварам.Скопировать();
	КонецЕсли; 
	//Преребираем строки товаров
	Для каждого СтрокаТоваров Из ВремРезультатЗапросаПоТоварам Цикл
		Количество=СтрокаТоваров.Количество;
 		//Если ВсеОК И Количество<>0 Тогда
			СтруктураОтбора=Новый Структура("Номенклатура,Партия",СтрокаТоваров.Номенклатура,СтрокаТоваров.Партия);
 			МассивНайденныхСтрокГТД=НаборЗаписейГТД.НайтиСтроки(СтруктураОтбора);
			Для СчГТД=0 По МассивНайденныхСтрокГТД.ВГраница() Цикл
				// Создаем запись регистра партий товаров в производстве
				ТекСтрокаГТД=МассивНайденныхСтрокГТД[СчГТД];
				НоваяЗапись=Добавить();
				НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
				НоваяЗапись.Период=ПериодДвижения;
				НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
				НоваяЗапись.Номенклатура=ТекСтрокаГТД.Номенклатура;
  				НоваяЗапись.Партия=ТекСтрокаГТД.Партия;
				НоваяЗапись.ГТД=ТекСтрокаГТД.ГТД;
				НоваяЗапись.ХозОперация=ШапкаДокумента.ХозОперация;
 				НоваяЗапись.Количество=Мин(ТекСтрокаГТД.Количество,Количество);
				К=НоваяЗапись.Количество/СтрокаТоваров.Количество;
				// пересчитаем сумму товара в валюту управленческого учета
				НоваяЗапись.Сумма=Окр(СтрокаТоваров.Сумма*К,2);
			//Попытка
			//		СуммаУпр=СтрокаТоваров.СуммаУпр;
			//	Исключение
			//		СуммаУпр=обПересчет(СтрокаТоваров.Сумма,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр);
			//	КонецПопытки;
			//	СуммаУпр=СуммаУпр*К;
			//	НоваяЗапись.СуммаУпр=Окр(СуммаУпр,2);
			//	ТекСтрокаГТД.Количество=ТекСтрокаГТД.Количество-НоваяЗапись.Количество;
				Количество=Количество-НоваяЗапись.Количество;
				Если ТекСтрокаГТД.Количество=0 Тогда
					НаборЗаписейГТД.Удалить(ТекСтрокаГТД);
				КонецЕсли;
				Если Количество=0 Тогда
					Прервать;
				КонецЕсли; 
			КонецЦикла;
			Если Количество>0 Тогда
				НоваяЗапись=Добавить();
				НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
				НоваяЗапись.Период=ПериодДвижения;
				НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
				НоваяЗапись.Номенклатура=СтрокаТоваров.Номенклатура;
   				НоваяЗапись.СтатусПартии=СтрокаТоваров.СтатусПартии;
				НоваяЗапись.Партия=СтрокаТоваров.Партия;
				НоваяЗапись.ГТД=Справочники.ГТД.ПустаяСсылка();
				НоваяЗапись.ХозОперация=ШапкаДокумента.ХозОперация;
 				НоваяЗапись.Количество=Количество;
				К=НоваяЗапись.Количество/СтрокаТоваров.Количество;
				// пересчитаем сумму товара в валюту управленческого учета
				НоваяЗапись.Сумма=Окр(СтрокаТоваров.Сумма*К,2);
			//Попытка
			//		СуммаУпр=СтрокаТоваров.СуммаУпр;
			//	Исключение
			//		СуммаУпр=обПересчет(СтрокаТоваров.Сумма,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр);
			//	КонецПопытки;
			//	СуммаУпр=СуммаУпр*К;
			//	НоваяЗапись.СуммаУпр=Окр(СуммаУпр,2);
			КонецЕсли; 
		//КонецЕсли; 
	КонецЦикла; 
	
	// запись движений
	Если ВсеОК Тогда Записать(); КонецЕсли; 
	
	ДокументОбъект=Неопределено;
	ШапкаДокумента=Неопределено;
	РезультатЗапросаПоТоварам=Неопределено;
 	
	Возврат ВсеОК;
КонецФункции

// Формирует движения по регистру расход (уменьшение товара в производстве)
// Возвращаемое значение: Булево. Истина - все ОК, Ложь - ошибка.
Функция Расход() Экспорт
	ВсеОК=Истина;
 	
	ПериодДвижения=?(ПериодДвижения=Неопределено,ШапкаДокумента.Дата,ПериодДвижения);
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	//Если ШапкаДокумента.КурсВалютыУпр=0 Тогда
	//	СтруктураКурса=обКурсДляВалюты(ВалютаУпр,ПериодДвижения);
	//	КурсУпр=СтруктураКурса.Курс/?(СтруктураКурса.Кратность=0,1,СтруктураКурса.Кратность);
	//Иначе
	//	КурсУпр=ШапкаДокумента.КурсВалютыУпр;
	//КонецЕсли; 
	
	// получим таблицу товарного состава
	Если (РезультатЗапросаПоТоварам=Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоТоварам)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоТоварам)<>Тип("ТаблицаЗначений")) Тогда
		РезультатЗапросаПоТоварам=ПолучитьТаблицуТоваров();
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоТоварам)=Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам.Выгрузить();
	КонецЕсли;
	ВремРезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам.Скопировать();
   	КолонкиСуммирования="Количество";
 	ВремРезультатЗапросаПоТоварам.Свернуть("Номенклатура,Партия",КолонкиСуммирования);
 	СтруктураОтбораТоваров=Новый Структура("Номенклатура");
	
	//Преребираем строки товаров
	Для каждого СтрокаТоваров Из ВремРезультатЗапросаПоТоварам Цикл
		Количество=СтрокаТоваров.Количество;
  		ТекПартия=СтрокаТоваров.Партия;
		//Найдем такую номенклатуру в заказ-наряде и сколько уже перемещено в производство
  		СтруктураОтбораТоваров.Номенклатура=СтрокаТоваров.Номенклатура;
  		Если ВсеОК И Количество<>0 Тогда
			// Создаем запись регистра заказов покупателей
			НоваяЗапись=Добавить();
			НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Расход;
			НоваяЗапись.Период=ПериодДвижения;
			НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
			НоваяЗапись.Номенклатура=СтрокаТоваров.Номенклатура;
   			НоваяЗапись.Партия=ТекПартия;
			НоваяЗапись.ХозОперация=ШапкаДокумента.ХозОперация;
 			// количество
			НоваяЗапись.Количество=Количество;
			НоваяЗапись.Сумма=Окр(СтрокаТоваров.Сумма,2);
 			// пересчитаем сумму товара в валюту управленческого учета
 		КонецЕсли; 
	КонецЦикла; 
	
	// запись движений
	Если ВсеОК Тогда Записать(); КонецЕсли; 
	
	ДокументОбъект=Неопределено;
	ШапкаДокумента=Неопределено;
	РезультатЗапросаПоТоварам=Неопределено;
 	
	Возврат ВсеОК;
КонецФункции

// Формирует движения по регистру приход (увеличение товара в производстве)
// Возвращаемое значение: Булево. Истина - все ОК, Ложь - ошибка.
Функция ПриходКомплекта() Экспорт
	ВсеОК=Истина;
	
 	ПериодДвижения=?(ПериодДвижения=Неопределено,ДокументОбъект.Дата,ПериодДвижения);
	ВалютаРегл=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	СтруктураКурса=обКурсДляВалюты(ВалютаРегл,ШапкаДокумента.Дата);
	КурсРегл=СтруктураКурса.Курс/?(СтруктураКурса.Кратность=0,1,СтруктураКурса.Кратность);
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	//КурсУпр=ШапкаДокумента.КурсВалютыУпр;
	
	//Преребираем строки товаров
	Для каждого СтрокаТоваров Из РезультатЗапросаПоТоварам Цикл
		НоваяЗапись=Добавить();
		НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
		НоваяЗапись.Период=ШапкаДокумента.Дата;
		НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
		НоваяЗапись.Номенклатура=СтрокаТоваров.Номенклатура;
  		НоваяЗапись.Партия=ШапкаДокумента.Ссылка;
		НоваяЗапись.Количество=СтрокаТоваров.Количество;
		НоваяЗапись.Сумма=обПересчет(СтрокаТоваров.СуммаВсего,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаРегл,КурсРегл);
		//НоваяЗапись.СуммаУпр=обПересчет(СтрокаТоваров.СуммаВсего,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр);
 		НоваяЗапись.ХозОперация=ШапкаДокумента.ХозОперация;
 	КонецЦикла;
	
	Возврат ВсеОК;
КонецФункции

// Предопределенная процедура
Процедура ПриЗаписи(Отказ, Замещение)
	
	// Зарегистрируем изменения для узлов РБД
	орРегистрацияИзменений(ЭтотОбъект);
	
КонецПроцедуры	//	ПриЗаписи()

////////////////////////////////////////////////////////////////////////
//Инициализация переменных модуля набора записей

РежимПроведения=РежимПроведенияДокумента.Оперативный;

ДокументОбъект=Неопределено; // !!! Обязательный к заполнению перед началом проведения
РезультатЗапросаПоТоварам=Неопределено;
ПериодДвижения=Неопределено;
